import React from 'react';
import '../css/Home.css';
import { useNavigate } from 'react-router-dom';

const Home = () => {
  const navigate = useNavigate();

  const handleFeatures = () => {
    navigate('/features');
  };

  return (
    <div className="home-container">
      <header className="home-header">
        <h1>Բարի գալուստ Ֆինանսական ռիսկերի կառավարման համակարգ</h1>
        <p>Ձեր միակ լուծումը ֆինանսական ռիսկերն արդյունավետ կառավարելու համար:</p>
        <button className="home-button" onClick={handleFeatures}>
        Գործառույթներ
        </button>
      </header>

      <section className="home-description">
        <h2>Մեր համակարգի մասին</h2>
        <p>
        Մեր համակարգը նորարարական գործիք է, որը նախատեսված է ֆինանսական ռիսկերի համապարփակ կառավարում ապահովելու համար: Դա օգնում է
        կազմակերպությունները՝ տվյալների վերլուծության, հաշվետվությունների ստեղծման և ռիսկերի ավտոմատացված գնահատումների հիման վրա տեղեկացված որոշումներ կայացնելու համար:
        </p>
      </section>

      <section className="home-features">
        <h2>Ինչու՞ ընտրել մեզ:</h2>
        <ul className='home-ul'>
          <li>✅ Հուսալիություն և ճշգրտություն – Մեր համակարգը հիմնված է նորագույն ալգորիթմների վրա, որոնք ապահովում են ֆինանսական ռիսկերն արդյունավետ վերլուծելու և կառավարելու հնարավորությունը։</li>
          <li>✅ Ավտոմատացված և արագ վերլուծություն – Ժամանակակից տեխնոլոգիաների շնորհիվ դուք ստանում եք ակնթարթային հաշվետվություններ և տվյալների վերլուծություն՝ առանց ժամանակ վատնելու։</li>
          <li>✅ Հեշտ օգտագործվող ինտերֆեյս – Հարմար և պարզեցված դիզայնը թույլ է տալիս ցանկացած օգտվողի հեշտությամբ աշխատել համակարգի հետ՝ անկախ ֆինանսական ոլորտում ունեցած գիտելիքներից։</li>
          <li>✅ Հարմարեցված լուծումներ – Մենք տրամադրում ենք տարբեր ֆինանսական գործիքներ, որոնք օգնում են կառավարել բյուջեն, գնահատել վարկային ռիսկերը և մշակել հուսալի ֆինանսական ռազմավարություն։</li>
        </ul>
      </section>

      <footer className="home-footer">
        <p>&copy; 2024 Financial Risk Management System. All rights reserved.</p>
      </footer>
    </div>
  );
};

export default Home;
